<template>
    <!-- 隐私协议 -->
    <div class="agreeshadow" @click.self="close">
        <div class="agreement" id="pointTop">
            <h2>元博网采购与招标网<br />隐私政策及用户服务协议</h2>
            <div class="content">
                <h4>1. 特别提示</h4>
                <p class="p1">
                    1.1 元博网采购与招标网（以下简称采招网）同意按照本协议的规定及其不定时发布的操作规则提供基于互联网的相关服务（以下称“网络服务”）。
                    为获得网络服务，服务使用人（以下称“用户”）应当同意本协议的全部条款并按照页面上的提示完成全部的注册程序。用户注册即代表用户同意本网站隐私政策和用户服务协议。</p>
                <h4>2. 服务内容</h4>
                <p>
                    2.1 采招网网络服务的具体内容由采招网根据实际情况提供，并保留随时变更、中断或终止部分或全部网络服务的权利。
                </p>
                <p>
                    2.2 采招网在提供网络服务时，会对部分网络服务的用户收取一定的费用。在此情况下，采招网会在相关页面上做明确的提示。如用户拒绝支付该项费用，
                    则不能使用相关的网络服务。
                </p>
                <p class="p1">
                    2.3 用户理解，采招网仅提供相关的网络服务，除此之外与相关网络服务有关的设备（如电脑、调制解调器及其他与接入互联网有关的装置）及所需的费用
                    （如为接入互联网而支付的电话费及上网费）均应由用户自行负担。
                </p>
                <h4>3. 使用规则</h4>
                <p>
                    3.1 用户在申请使用采招网网络服务时，必须提供准确的企业及个人资料，如资料有任何变动，必须及时更新。
                </p>
                <p>
                    3.2 用户注册成功后，采招网将给予每个用户一个用户名及相应的密码，该用户名和密码由用户负责保管；用户应当对以其用户名进行的所有活动和事件负法律责任。
                </p>
                <p>
                    3.3 用户必须同意接受采招网通过电子邮件或其他方式向用户发送的相关网站服务信息。
                </p>
                <p>
                    3.4 用户必须同意遵循以下原则：
                    <p class="p2"><span>（a）</span>遵守中国有关的法律和法规；</p>
                    <p class="p2"><span>（b）</span>不得为任何非法目的而使用网络服务系统；</p>
                    <p class="p2"><span>（c）</span>遵守所有与网络服务有关的网络协议、规定和程序；</p>
                    <p class="p2"><span>（d）</span>不得利用采招网网络服务系统进行任何可能对互联网的正常运转造成不利影响的行为；</p>
                    <p class="p2"><span>（e）</span>不得利用采招网网络服务系统传输任何骚扰性的、中伤他人的、辱骂性的、恐吓性的、庸俗淫秽的或其他任何非法的信息资料；</p>
                    <p class="p2"><span>（f）</span>不得利用采招网网络服务系统进行任何不利于采招网的行为；</p>
                    <p class="p2"><span>（g）</span>如发现任何非法使用用户名或用户出现安全漏洞的情况，应立即通告采招网。</p>
                </p>
                <p>
                    3.5用户必须同意遵循以下规则：
                    <p class="p2"><span>（a）</span>一个用户名只属于一个企业或个人，同一时间只能在一台机器上使用，并且一周内不能在超过7台不同的机器上使用。
                        未经采招网书面许可，用户不得将其用户名、密码转售、赠与、转借、租供给第三方或用于商业性用途。否则，由此造成的一切后果和责任由
                        用户承担；同时，采招网有权单方面中止为其提供的服务。</p>
                    <p class="p2 p1"><span>（b）</span>未经采招网书面许可，用户不得利用采招网所获得的信息用于商业用途，如发现用户与采招网形成竞争或损害采招网的利益，
                        或采招网认为对其正常运营造成损害的其他行为，采招网有权单方面终止其使用资格，由此造成的一切后果和责任由用户承担。 </p>
                </p>
                <h4>4. 内容所有权</h4>
                <p>
                    4.1 采招网提供的网络服务内容受版权、商标和其它财产所有权法律的保护。
                </p>
                <p class="p1">
                    4.2 用户只有在获得采招网或其他相关权利人的授权之后才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。
                </p>
                <h4>5. 隐私保护</h4>
                <p>
                    5.1 保护用户隐私是采招网的一项基本政策，采招网保证不对外公开或向第三方提供用户注册资料及用户在使用网络服务时存储在采招网的非公开内容，但下列情况除外： 
                    <p class="p2"><span>（a）</span>事先获得用户的明确授权；</p>
                    <p class="p2"><span>（b）</span>根据有关的法律法规要求；</p>
                    <p class="p2"><span>（c）</span>按照相关政府主管部门的要求；</p>
                    <p class="p2"><span>（d）</span>为维护社会公众的利益；</p>
                    <p class="p2 p1"><span>（e）</span>为维护采招网的合法权益。</p>
                </p>
                <h4>6. 免责声明</h4>
                <p>
                    6.1 用户使用采招网网络服务所存在的风险将完全由其自己承担；因其使用采招网网络服务而产生的一切后果也由其自己承担，采招网对用户不承担任何责任。
                </p>
                <h4>7. 服务变更、中断或终止</h4>
                <p>
                    7.1 如因系统维护或升级的需要而需暂停网络服务，采招网将尽可能事先进行通告。
                </p>
                <p>
                    7.2 如发生下列任何一种情形，采招网有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：
                    <p class="p2"><span>（a）</span>用户提供的个人资料不真实；</p>
                    <p class="p2"><span>（b）</span>用户违反本协议中规定的使用规则。</p>
                </p>
                <p class="p1">
                    7.3 除前款所述情形外，采招网同时保留在事先通知用户的情况下随时中断或终止部分或全部网络服务的权利，对于所有服务的中断或终止而造成的任何损失，采招网无需对用户或任何第三方承担任何责任。
                </p>
                <h4>8. 违约赔偿</h4>
                <p class="p1">
                    8.1 用户同意保障和维护采招网及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给采招网或任何其他第三人造成损失，用户同意承担由此造成的损害赔偿责任。
                </p>
                <h4>9. 修改协议</h4>
                <p>
                    9.1 采招网将可能不时的修改本协议的有关条款，一旦条款内容发生变动，采招网将会在相关的页面提示修改内容。
                </p>
                <p class="p1">
                    9.2 如果不同意采招网对服务条款所做的修改，用户有权停止使用网络服务。如果用户继续使用网络服务，则视为用户接受服务条款的变动。
                </p>
                <h4>10. 通知和送达</h4>
                <p class="p1">
                    10.1 本协议项下所有的通知均可通过重要页面公告、电子邮件或常规的信件传送等方式进行；该等通知于发送之日视为已送达收件人。
                </p>
                <h4>11. 其他规定</h4>
                <p>
                    11.1 本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他权利。
                </p>
                <p>
                    11.2 如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，本协议的其余条款仍应有效并且有约束力。
                </p>
            </div>
        </div>
        <div class="close" @click="close">
            <img src="../assets/images/close.png" alt="">
        </div>
    </div>
</template>

<script>
    export default {
        data() {
            return{

            }
        },
        methods:{
            close() {
                console.log(2);
                this.$emit("closeAgree")
            }
        }
    }
</script>

<style lang="less" scoped>
    /* 隐私协议 */
    .agreeshadow {
        position: fixed;
        left: 0;
        right: 0;
        top: 0;
        bottom: 0;
        margin: auto;
        background-color: rgba(0, 0, 0, .2);
        z-index: 99;
        // display: none;
    }

    .agreeshadow .agreement {
        width: 6rem;
        height: 9rem;
        padding: 0 0.4rem;
        background-color: #fff;
        border-radius: 0.08rem;
        position: absolute;
        left: 50%;
        top: 20%;
        transform: translate(-50%);
        text-align: center;
        font-size: 0.26rem;
        overflow-y: scroll;
    }

    .agreement h2 {
        font-size: 0.28rem;
        line-height: 0.44rem;
        color: #000;
        margin: 0.2rem 0;
    }

    .agreement p,
    .agreement h4 {
        font-size: 0.26rem;
        line-height: 0.5rem;
        text-align: left;
        color: #333;
    }

    .agreement .p2 {
        color: #666;
    }

    .agreeshadow .close {
        position: absolute;
        left: calc(50% + 2.6rem) ;
        top: calc(20% - .6rem);
        // transform: translate(-50%);
        width: 0.4rem;
        height: 0.4rem;
        // right: .7rem;

    }

    .agreeshadow .close img {
        width: 0.4rem;
        height: 0.4rem;
    }

    .container .xieyi {
        line-height: 0.24rem;
        font-size: 0.22rem;
        margin-bottom: 0.24rem;
        color: #999;
        text-align: center;
    }

    .container .xieyi span {
        color: #333;
    }
</style>